export type PlaceData = {
  id: string;
  title: string;
  imageUrl: string;
  description: string;
  example: string;
  result: string;
};

export const PLACES_DATA: PlaceData[] = [
  {
    id: 'academy',
    title: 'Академия',
    imageUrl: 'public/events/rasm1.png',
    description:
      'Ведущий научно-творческий центр страны, осуществляющий подготовку специалистов в области изобразительного искусства, дизайна, декоративно-прикладного искусства и искусствоведения.',
    example: 'Академия художеств Узбекистана',
    result: 'Подготовка профессиональных художников, дизайнеров и искусствоведов.',
  },
  {
    id: 'summer-school',
    title: 'Летние школы',
    imageUrl: 'public/events/rasm2.png',
    description:
      'Образовательная и культурная площадка для студентов Узбекистана и зарубежных стран, направленная на обмен опытом и развитие практических навыков.',
    example: 'Международная летняя школа в Хиве',
    result: 'Получение международного опыта и развитие профессиональных компетенций участников.',
  },
  {
    id: 'festivals',
    title: 'Фестивали',
    imageUrl: 'public/events/rasm3.png',
    description:
      'Международный фестиваль, объединяющий современное искусство, электронную музыку и экологические инициативы.',
    example: 'Stihia Festival (Муйнак)',
    result:
      'Повышение туристической привлекательности региона и популяризация культурного потенциала Узбекистана.',
  },
  {
    id: 'residencies',
    title: 'Резиденции',
    imageUrl: 'public/events/rasm4.png',
    description:
      'Платформа для совместной творческой деятельности местных и зарубежных художников.',
    example: 'Резиденциальные программы Art and Culture Development Foundation',
    result: 'Создание новых художественных проектов и развитие международного сотрудничества.',
  },
  {
    id: 'cultural-media',
    title: 'Культурные и медиа-проекты',
    imageUrl: 'public/events/rasm5.png',
    description:
      'Международный проект, объединяющий современное искусство, культурное наследие и креативные индустрии.',
    example: 'Bukhara Biennale',
    result:
      'Укрепление международного имиджа и культурного авторитета Узбекистана.',
  },
];
